In [1]:
import pandas as pd

In [2]:
# create dataframe
data = [{'name': 'Krish', 'age': 31, 'experience': 10, 'salary':30000}, 
        {'name': 'Sudhanshu', 'age': 30, 'experience': 8, 'salary':25000},
        {'name': 'Sunny', 'age': 29, 'experience': 4, 'salary':20000},
        {'name': 'Paul', 'age': 24, 'experience': 3, 'salary':20000},
        {'name': 'Harsha', 'age': 21, 'experience': 1, 'salary':15000},
        {'name': 'Shubham', 'age': 23, 'experience': 2, 'salary':18000},
        {'name': 'Maheesh', 'age': None, 'experience': None, 'salary':40000},
        {'name': None, 'age': 34, 'experience': 10, 'salary':38000},
        {'name': None, 'age': 36, 'experience': None, 'salary': None},
       ]

In [3]:
df = pd.DataFrame(data)

In [4]:
df

        name   age  experience   salary
0      Krish  31.0        10.0  30000.0
1  Sudhanshu  30.0         8.0  25000.0
2      Sunny  29.0         4.0  20000.0
3       Paul  24.0         3.0  20000.0
4     Harsha  21.0         1.0  15000.0
5    Shubham  23.0         2.0  18000.0
6    Maheesh   NaN         NaN  40000.0
7       None  34.0        10.0  38000.0
8       None  36.0         NaN      NaN

In [5]:
df.to_csv('../Data/test.csv', index= False)

In [6]:
# create dataframe
data = [{'name': 'Krish', 'department': 'Data Science', 'salary':10000}, 
        {'name': 'Krish', 'department': 'IOT', 'salary':5000},
        {'name': 'Mahesh', 'department': 'IOT', 'salary':4000},
        {'name': 'Krish', 'department': 'IOT', 'salary':4000},
        {'name': 'Mahesh', 'department': 'IOT', 'salary':3000},
        {'name': 'Sudhanshu', 'department': 'IOT', 'salary':20000},
        {'name': 'Sudhanshu', 'department': 'IOT', 'salary':10000},
        {'name': 'Sudhanshu', 'department': 'IOT', 'salary':5000},
        {'name': 'Sunny', 'department': 'IOT', 'salary':10000},
        {'name': 'Sunny', 'department': 'IOT', 'salary':2000},
       ]

In [7]:
df = pd.DataFrame(data)

In [8]:
df

        name    department  salary
0      Krish  Data Science   10000
1      Krish           IOT    5000
2     Mahesh           IOT    4000
3      Krish           IOT    4000
4     Mahesh           IOT    3000
5  Sudhanshu           IOT   20000
6  Sudhanshu           IOT   10000
7  Sudhanshu           IOT    5000
8      Sunny           IOT   10000
9      Sunny           IOT    2000

In [9]:
df.to_csv('../Data/test2.csv', index= False)